#Game Over - версия 2.0
# Показывает разные приёмы работы со строками
print("Программа 'Game Over' 2.0")
print(
    """
     ____         ____        ___   ___    ______
    / ___|       / _  |      /   | /   |  |  ____|
    | |         / /_| |     / /| |/ /| |  | |____
    | |  _     / ___  |    / / |___/ | |  |  ____|
    | |_| |   / /   | |   / /        | |  | |____
    \_____/  /_/    |_|  /_/         |_|  |______|

        ______    _    __   ______    ______
       /  __  \  | |  / /  |  ____|  |  __  \\
       | |  | |  | | / /   | |____   | |__| |
       | |  | |  | |/ /    |  ____|  |  __  /
       | |__| |  |   /     | |____   | |  \ \\
       \______/  |__/      |______|  |_|   \_\\

    """
)

print("\a") # Звук системного динамика
input("Нажмите Enter, чтобы выйти")